; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-92)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 v7 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 l16 - location
    c0 c1 c2 c3 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity v5 c3)
    (capacity v6 c2)
    (capacity v7 c3)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (capacity-predecessor c2 c3)
    (at p1 l2)
    (at p2 l3)
    (at p3 l10)
    (at p4 l9)
    (at p5 l10)
    (at p6 l7)
    (at p7 l1)
    (at p8 l13)
    (at p9 l14)
    (at p10 l6)
    (at p11 l3)
    (at p12 l10)
    (at p13 l5)
    (at p14 l1)
    (at p15 l14)
    (at p16 l11)
    (at v1 l6)
    (at v2 l10)
    (at v3 l3)
    (at v4 l5)
    (at v5 l4)
    (at v6 l11)
    (at v7 l3)
    (road l6 l15)
    (road l3 l1)
    (road l12 l16)
    (road l14 l7)
    (road l5 l7)
    (road l10 l6)
    (road l10 l9)
    (road l16 l4)
    (road l1 l3)
    (road l16 l10)
    (road l1 l15)
    (road l14 l12)
    (road l9 l10)
    (road l13 l4)
    (road l1 l2)
    (road l2 l1)
    (road l15 l1)
    (road l16 l12)
    (road l6 l10)
    (road l12 l11)
    (road l12 l14)
    (road l4 l16)
    (road l4 l13)
    (road l8 l16)
    (road l11 l12)
    (road l10 l16)
    (road l15 l6)
    (road l16 l8)
    (road l7 l5)
    (road l7 l14)
    (road l10 l12)
    (road l12 l10)
    (road l7 l16)
    (road l16 l7)
    (road l6 l11)
    (road l11 l6)
    (road l8 l11)
    (road l11 l8)
    (road l9 l11)
    (road l11 l9)
    (road l9 l12)
    (road l12 l9)
    (road l6 l16)
    (road l16 l6)
    (road l14 l16)
    (road l16 l14)
    (road l4 l5)
    (road l5 l4)
    (road l2 l8)
    (road l8 l2)
    (road l3 l5)
    (road l5 l3)
    (road l4 l9)
    (road l9 l4)
    (road l11 l16)
    (road l16 l11)
    (road l8 l15)
    (road l15 l8)
    (road l2 l6)
    (road l6 l2)
    (road l2 l15)
    (road l15 l2)
    (road l8 l14)
    (road l14 l8)
    (road l6 l14)
    (road l14 l6)
    (road l12 l13)
    (road l13 l12)
    (road l1 l9)
    (road l9 l1)
    (road l3 l10)
    (road l10 l3)
    (road l4 l15)
    (road l15 l4)
    (road l2 l4)
    (road l4 l2)
    (road l5 l16)
    (road l16 l5)
    (road l8 l9)
    (road l9 l8)
    (road l4 l6)
    (road l6 l4)
    (road l11 l13)
    (road l13 l11)
    (road l2 l10)
    (road l10 l2)
    (road l5 l6)
    (road l6 l5)
    (road l7 l12)
    (road l12 l7)
    (road l7 l13)
    (road l13 l7)
    (road l10 l14)
    (road l14 l10)
    (road l13 l14)
    (road l14 l13)
    (road l2 l12)
    (road l12 l2)
    (road l4 l11)
    (road l11 l4)
    (road l10 l11)
    (road l11 l10)
    (road l10 l13)
    (road l13 l10)
    (road l1 l11)
    (road l11 l1)
    (road l3 l6)
    (road l6 l3)
    (road l13 l15)
    (road l15 l13)
    (road l3 l15)
    (road l15 l3)
    (road l5 l14)
    (road l14 l5)
    (road l1 l16)
    (road l16 l1)
    (road l3 l12)
    (road l12 l3)
    (road l2 l5)
    (road l5 l2)
    (road l8 l13)
    (road l13 l8)
    (road l6 l8)
    (road l8 l6)
    (road l2 l7)
    (road l7 l2)
    (road l6 l9)
    (road l9 l6)
    (road l4 l12)
    (road l12 l4)
    (road l5 l13)
    (road l13 l5)
    (road l3 l4)
    (road l4 l3)
    (road l5 l10)
    (road l10 l5)
    (road l7 l8)
    (road l8 l7)
    )
 (:goal (and 
(at p1 l14)
(at p2 l2)
(at p3 l13)
))
)

; plan
1. (pick-up v3 l3 p2 c1 c2)
   deleted: (at p2 l3) (capacity v3 c2)
   added: (in p2 v3) (capacity v3 c1)
   goals met: 0 of 3
2. (drive v3 l3 l1)
   deleted: (at v3 l3)
   added: (at v3 l1)
   goals met: 0 of 3
3. (drive v3 l1 l2)
   deleted: (at v3 l1)
   added: (at v3 l2)
   goals met: 0 of 3
4. (pick-up v3 l2 p1 c0 c1)
   deleted: (at p1 l2) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 0 of 3
5. (drop v3 l2 p2 c0 c1)
   deleted: (in p2 v3) (capacity v3 c0)
   added: (at p2 l2) (capacity v3 c1)
   goals met: 1 of 3
6. (pick-up v2 l10 p3 c1 c2)
   deleted: (at p3 l10) (capacity v2 c2)
   added: (in p3 v2) (capacity v2 c1)
   goals met: 1 of 3
7. (drive v2 l10 l13)
   deleted: (at v2 l10)
   added: (at v2 l13)
   goals met: 1 of 3
8. (drop v2 l13 p3 c1 c2)
   deleted: (in p3 v2) (capacity v2 c1)
   added: (at p3 l13) (capacity v2 c2)
   goals met: 2 of 3
9. (drive v3 l2 l10)
   deleted: (at v3 l2)
   added: (at v3 l10)
   goals met: 2 of 3
10. (drive v3 l10 l14)
   deleted: (at v3 l10)
   added: (at v3 l14)
   goals met: 2 of 3
11. (drop v3 l14 p1 c1 c2)
   deleted: (in p1 v3) (capacity v3 c1)
   added: (at p1 l14) (capacity v3 c2)
   goals met: 3 of 3
